chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
//#define  G_S_IO                  P10
//#define  G_S_IO_SET              P10_Input_Mode   

//#define  POWER_SW_IO		      P10
//#define  POWER_SW_IO_SET          P10_Quasi_Mode   

//#define  PROT            P14
//#define  PROT_SET        P14_Quasi_Mode
#define  RELY            P07
#define  RELY_SET        P07_PushPull_Mode     //不用到该IO口


#define  BACK_CTRL         P10
#define  BACK_CTRL_SET	   P10_PushPull_Mode    //后退---已改


#define  FRONT_CTRL        P00  
#define  FRONT_CTRL_SET	   P00_PushPull_Mode     //前进---ok


#define PWMOUT            P03// FP23  //
#define PWMOUT_SET	       P03_PushPull_Mode //    ok

#define PWMOUTt            P01// FP23  //
#define PWMOUTt_SET	       P01_PushPull_Mode //   ok


#define  Vol_IO          P11
#define  Vol_IO_SET	     P11_Input_Mode     //电压检测---ok

 
#define  A_DET_IO           P06              //短路电流检测---ok
#define  A_DET_IO_SET	      P06_Quasi_Mode


#define  MOS_DET_IO          	P04
#define  MOS_DET_INPUT_SET	    P04_Input_Mode
  #define  MOS_DET_OUTPUT_SET	    P04_PushPull_Mode


#define  SW_IO           P13
#define  SW_IO_SET	    P13_Input_Mode

#define  POWER_IO          P14
#define  POWER_IO_SET	    P14_PushPull_Mode



 unsigned char POWER_on_TM;

 unsigned char ELE_BIG_SET2;
 unsigned char ELE_BIG_SET1;
  unsigned char ELE_BIG_SET3;
  unsigned char VoltageLowWait;
 unsigned char  ShaCheTM;//2*20MS
  unsigned char LED_TM;  //调到闪的频率0.26MS
 unsigned char LED_pwm; //中间变量
 unsigned char LED_CT;//闪的次数X2
 unsigned char CurDanWei_AD;
 unsigned char  G_S_HighCT;
unsigned char   ELE_InterruptDISP_TM;

 bit NO_Connet_FL;

bit turn_zero_fl;
 bit  ELE40_BIG_FL;
 
 bit G_S_old_FL;
 bit  G_S_L2H_FL;
 
   bit  ELE60_BIG_FL;
	 
 unsigned char ELE40_BIG_ct;
 unsigned char	ELE40_Small_ct;

 unsigned char  ELE60_BIG_TM;

 unsigned int NO_Connet_ct;	

  bit POWER_ON_IO ;

 unsigned int  ELE_Wait_5s;
 unsigned char  VoltageLowCT;
bit  VoltageLowFL;
unsigned char AD_CH,Voltage_AD,DanWei_AD;//PWM_HallSet;
unsigned char ELE50_BIG_ct;
unsigned char	ELE50_Small_ct=0;
bit	ELE50_BIG_FL;

unsigned char  DanWei_PWM;
unsigned char PWM_Ele_Set;
unsigned int Hall_Add,HallLowCT;            
unsigned char   Hall_Add_ct;	
unsigned char Cur_ResultNew;
unsigned char  time_500ms;

unsigned char DanWei;

  unsigned char ELE13_BIG_TM;
	unsigned char ELE13_Small_ct;
	unsigned char ELE13_BIG_ct;

	bit	ELE13_BIG_FL;
	
	bit ELE35_BIG_ERR_FL;
	
bit ELE_ERR_FL;
 bit BIT_TMP;
 bit FRONT_FL;
 bit BACK_FL;
 bit HIGH_LOWS_PEED_FLold;

bit TurnHighSpeed_FL;
bit TurnHighSpeed_FL_New;

	bit CHANGE;
	bit LA;
	bit CHANGE_FL;
	bit HIGH_LOWS_PEED_FL;
	bit HIGH_LOWS_PEED;

	bit  ELE12_BIG_FL;
	bit ELE25_BIG_ERR_FL;//
	unsigned char   ELE12_BIG_TM;
	unsigned char ELE12_BIG_ct;
	unsigned char  ELE12_Small_ct;


	bit	ELE30_BIG_ERR_FL;//
	unsigned char	ELE30_BIG_TM;

  	bit	ELE20_BIG_ERR_FL;//
	unsigned char	ELE20_BIG_TM;


unsigned int	   Stop_same;
bit  Stop_FL;
bit Stop_Old;
unsigned char   ELE_BIG_TM;
 bit ELE_BIG_FL;
 bit G_S_Old;
 bit G_S_FL;
   unsigned char G_S_State;
 unsigned char  G_S_same;

bit A_DET_FL;

 bit FRONT_BACK_FL;


unsigned char   PWMADDTM;//
 
unsigned char TIME_20MS_CT;//
  

unsigned char  PWMold;//?????
unsigned char count_500US_CT;//500us
unsigned char PWM;
 
unsigned char CHANGE_Off_TM;

 unsigned char  FrontOFFTime;
unsigned char	BackOFFTime; 


unsigned char  DelayOffTM;//50MS/20MS=3 /*刹车时间*/
unsigned char  BeginMoveBackTM;
unsigned char  BeginMoveFrontTM;
unsigned char  PWM_MAX_Set;		  
	  
 unsigned char Count1S;


unsigned char Count2_5MS;     
     
 unsigned char   G_S_FL_CT;	

 
 unsigned char  volHand_addct;
 unsigned int   volHand_add;   

  unsigned char  vol_addct;
 unsigned int   vol_add;  

 unsigned char ELE30_BIG_ct=0;
 unsigned char ELE30_Small_ct;			 
	bit		ELE30_BIG_FL;


  unsigned char   RELYDelayTM ;

 unsigned char     ELE28_BIG_ct,ELE28_BIG_TM;
 unsigned char     ELE28_Small_ct;

   unsigned char MOS_Err;

 
  bit              ELE28_BIG_FL;
  bit      ELE28_BIG_ERR_FL;

  bit FLAG_IO_PWM;

//-----------更改增加的变量
   bit qudiao_shache_FL;
   bit ceshi_zhengchang_FL;
	
	 bit yunxun_FL;
	 bit shangdian_yunxun_FL;
  unsigned char G_S_HighCT_fanjiao;
	 
   unsigned char PWM_HallSet;
	 
	 	 bit PWM_xianzhi_fl;
	 
	 
	 
	 	  bit SW_FL;
  unsigned char guanji_timer,guangji_1stimer,guangji_1mintimer;
	 unsigned char sw_timer,SW_yanshi;
	 bit FLAG_NMS;
	 
	 bit NO_Connet_FL1;
	 		
	 bit shache_4ms;
	
 bit  dang_23fl;
		unsigned char 		xiajiang_3dan_timer;
		unsigned char 		xiajiang_2dan_timer;

unsigned char PWM_HUAN;
bit PWM_xianzhi_fl;
 unsigned int xianliu65_same;
bit xianliu_fl;

unsigned char jinxianliuTM;

bit  duZ_close_fl;

bit duanlu_sw_fl;

bit DanWei3_40,DanWei3_65,DanWei2_40;

bit jia_close_led_fl,huanxing_fl;

unsigned char sw_songtimer;
	
bit duzhuan_30min_fl;
unsigned char duzhuan_cishu_num;
bit duzhuan_cishu_fl;	
bit jia_zheng_close_fl;	
 //unsigned char deadtmphigh,deadtmplow;

#define UINT16 unsigned int
#define UINT8 unsigned char
	
//unsigned char A_P_ResultNew;
unsigned char  A_P_CT,A_P_CT1,A_P_CT2,A_P_CT3,A_P_CT4,A_P_CT5;
bit ELEAP_BIG_ERR_FL,ELEAP_BIG_ERR_FL1,ELEAP_BIG_ERR_FL2,ELEAP_BIG_ERR_FL3,ELEAP_BIG_ERR_FL4,ELEAP_BIG_ERR_FL5;

//------------------------------------------------------------------------------------
	
void time_dsp(void);


void Delay3us()		//@16MHz
{
	unsigned char i;

	_nop_();
	_nop_();
	i = 9;
	while (--i);
}


//----------------死区时间设置--------------------
/*void PWM_DEAD_TIME_VALUE(UINT16	DeadTimeData)
{
	UINT8 deadtmphigh,deadtmplow;
	deadtmplow = DeadTimeData;
	deadtmphigh = DeadTimeData>>8;
	BIT_TMP = EA;
	if (deadtmphigh==0x01)
	{
		EA = 0;
		TA = 0xAA;
		TA = 0x55;
		PDTEN|=0x10;
	}
	TA = 0xAA;
	TA = 0x55;
	PDTCNT = deadtmplow;
	EA = BIT_TMP;
}*/

void PWM_DEAD_TIME_VALUE()
{
	UINT8 deadtmphigh,deadtmplow;
	deadtmplow = 94;
	deadtmphigh = 11;
	BIT_TMP = EA;
	if (deadtmphigh==0x01)
	{
		EA = 0;
		TA = 0xAA;
		TA = 0x55;
		PDTEN|=0x10;
	}
	TA = 0xAA;
	TA = 0x55;
	PDTCNT = deadtmplow;
	EA = BIT_TMP;
}


//---------------------------------

void init(void)
{ 
    BACK_CTRL=0;
    FRONT_CTRL=0;   

	SW_FL=0;
	 
	SW_IO_SET;
	NO_Connet_FL1=0;
	PWM_xianzhi_fl=0;
	A_DET_IO_SET;
	
PWM_xianzhi_fl=0;
 STOP_IO_SET;
 duZ_close_fl=0;      //堵转允许关机标志位
 A_0_IO_SET;           	        
 RELY_SET;                    
 BACK_CTRL_SET;  					   
 FRONT_CTRL_SET;
  BACK_CTRL=0 ;
  FRONT_CTRL=0;   
 PWMOUT_SET;	 
PWMOUTt_SET;  
 STOP_IO_SET;	
 Vol_IO_SET;		
// POWER_SW_IO_SET; 
 LED_SET;
 LED1_SET;   
MOS_DET_INPUT_SET;	
//  POWER_ON_SET;
  //  PWM_EN_IO_SET;

		 PWM5_P03_OUTPUT_ENABLE;	
		 PWM4_P01_OUTPUT_ENABLE;
	   PWM_COMPLEMENTARY_MODE;	     //设置为互补模式
		 
	//PWM4_OUTPUT_INVERSE;	
		PWM5_OUTPUT_INVERSE;

