chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
		set_PDT45EN;    //使能死区
		PWM_CLOCK_DIV_32;//PWM_CLOCK_DIV_16=3.9k;	  PWM_CLOCK_DIV_32=2k PWM_CLOCK_DIV_64=1k
		PWMPH = 0x00;
		PWMPL = 0xFF;//F0=4.1K  FF=3.9K
		//PWM_DEAD_TIME_VALUE(94);   //死区时间设置   27=2us     81=5us     94=6us
		PWM_DEAD_TIME_VALUE();
/**********************************************************************
	PWM frequency = Fpwm/((PWMPH,PWMPL) + 1) <Fpwm = Fsys/PWM_CLOCK_DIV> 
								= (16MHz/8)/(0x7CF + 1)
								= 1KHz (1ms)
***********************************************************************/	
		set_SFRPAGE;			 		     //PWM4 and PWM5 duty seting is in SFP page 1
		PWM4H = 0x00;						
		PWM4L = 0x00;
		clr_SFRPAGE;											

//-------- PWM start run--------------
    set_LOAD;
    set_PWMRUN;
///////////////////////////////////
    RH3 = RELOAD_VALUE_H;                       //initial counter values 
    RL3 = RELOAD_VALUE_L;       
    set_ET3;                                    //enable Timer3 interrupt
    set_EA;                                     //enable interrupts
    set_TR3;
  /////////////////////////////////	              
   Enable_ADC_BandGap; 
    Enable_ADC_AIN0;        //P17脚踏板油门

		AD_CH=5;
		clr_ADCF;
		set_ADCS; 
		EADC=0;                                                                                                                                       // Each time ADC start trig signal
   // while(ADCF == 0);
//////////////////////////////
P0=0XFe;
//P1=0XDD;
//POWER_SW_IO=1;
 PWM=0;
CHANGE_Off_TM=0;
PWM_MAX_Set=255;
PWMold=1;
POWER_ON_IO=1; 
//PROT=0;
//IO_1=0;
//IO_2=0;
STOP_IO=1;
CHANGE_FL=1;
A_DET_FL=1;
//I_Err_LED_FL=0;
PWM_Ele_Set=128;
LED_IO=1;           //电源指示灯
LED1_IO=0;        //进入测试模式--指示灯
POWER_on_TM=0;

qudiao_shache_FL=0;
ceshi_zhengchang_FL=0;
yunxun_FL=0;
shangdian_yunxun_FL=1;

POWER_IO_SET;
	
	POWER_IO=1;    //POWER 上电即是高电平
dang_23fl=0;
xiajiang_3dan_timer=0;
xiajiang_2dan_timer=0;
xianliu_fl=0;
	LED1_IO=0;	
		jinxianliuTM=0;
		duanlu_sw_fl=0;    //允许电源开关关机
		ELEAP_BIG_ERR_FL=0;
		
		A_P_CT=0;
		A_P_CT1=0;
   A_P_CT2=0;
	 A_P_CT3=0;
	 A_P_CT4=0;
	 A_P_CT5=0;
	 
	  DanWei3_40=0;
		DanWei3_65=0;		
		DanWei2_40=0;
		jia_close_led_fl=0;
		huanxing_fl=0;
		sw_songtimer=0;
		duzhuan_30min_fl=0;
		duzhuan_cishu_num=0;
		duzhuan_cishu_fl=0;
		jia_zheng_close_fl=0;
 }


 void Timer3_ISR (void) interrupt 16 
{
	   clr_TF3;
    count_500US_CT++;	
}


 void  MoveCtrl(void)
 {	 
	 
	   if(FRONT_CTRL==0&&BACK_CTRL==0) 
		 {
       if(G_S_State==1)
       {					
            G_S_State=2;
            MOS_Err=0;
					 
						MOS_DET_OUTPUT_SET;
						MOS_DET_IO=0;//检测前先放电
						count_500US_CT=0;
						while(count_500US_CT<=40)//10MS=20
						{
						 ;
						}
              MOS_DET_INPUT_SET;
               count_500US_CT=0;
             while(count_500US_CT<=3)         //1.5ms  转变输入检测
               {
                 ;
               }
              count_500US_CT=0;
             while(count_500US_CT<=2)     //1ms
               {
                  if(MOS_DET_IO)              //如果检测到是高电平  
                  {                   
                       MOS_Err=1;                //则表明上桥是短路的   闪6下
                       G_S_State=0xff;
                  }
               }
                              
               MOS_DET_OUTPUT_SET;      //强输出状态
               MOS_DET_IO=1;           //充电
              count_500US_CT=0;
             while(count_500US_CT<=40)    //40*05=20ms
               {					 
                  ;
               }
               MOS_DET_INPUT_SET;       //这里转变IO口  不需要时间转变了？
              count_500US_CT=0;
             while(count_500US_CT<=2)    //检测1ms
               {
                  if(MOS_DET_IO==0)     // 如果检测是低电平
                  {                     
                     MOS_Err=2;          //则表示下桥短路故障     闪7下
                     G_S_State=0xff;
                  }
               } 
						
															 
    }
  }
		 else
		 {
		      G_S_State=2;		   	 
		 }

      
  if(PWMold!=PWM)
  {
     PWMold=PWM;

		set_SFRPAGE;						//PWM4 and PWM5 duty seting is in SFP page 1
		PWM4H = 0x00;						
		PWM4L = (255-PWM);
		clr_SFRPAGE;				
		 set_LOAD;
      // if(PWM==0)//>=0xfe)
		 if(PWM>=0xfe)//==0)
		 {
			PWM5_P03_OUTPUT_DISABLE;
			PWM4_P01_OUTPUT_DISABLE;
			FLAG_IO_PWM=1;
			P01=0;//换为IO
			P03=0;               //1
		  // PWM_EN_IO=0;
		 }
		 else
		 // if(PWM>=0xfe)//==0)
		  if(PWM==0)//>=0xfe)
		 {
			PWM5_P03_OUTPUT_DISABLE;
			PWM4_P01_OUTPUT_DISABLE;
			FLAG_IO_PWM=1;
			P01=0;//换为IO      //上桥
			P03=1;            // 下桥
			//PWM_EN_IO=0;
		 }
		else
		{
		      if(FLAG_IO_PWM)
            {      
               
			
			          PWM5_P03_OUTPUT_ENABLE;    //下桥
                  count_500US_CT=0;
									
            
						
                PWM4_P01_OUTPUT_ENABLE;     //上桥
			

              FLAG_IO_PWM=0;	 
            }			  			  	 
		}

  }
 }


void time_dsp(void)
{
  unsigned char temp;
	
   if(count_500US_CT)//;count_500US_CT>=10U;count_500US_CT-=10)//50*10=500US
	   {
	     count_500US_CT=0;
			  
			
		   if(G_S_HighCT<250)     //脚踏  放开清零  按下计数
		   G_S_HighCT++;      //0.5ms
			 
			 if(G_S_HighCT_fanjiao<250)   //脚踏   按下清零   放开计数
			 G_S_HighCT_fanjiao++;


        Count2_5MS++;
    if(Count2_5MS>=8)    //4ms自加一次
		{
		  Count2_5MS=0;
	    Count1S++;
				FLAG_NMS=1;
			   shache_4ms=1;
    if(Count1S>250)
	 {
        Count1S=0;
		    
		 if(ELE_InterruptDISP_TM)
			 ELE_InterruptDISP_TM--;
		 
       if(CHANGE_Off_TM)
	   {
	      CHANGE_Off_TM--;
		//  PROT=1;
		  }

      }
	  }
 ////////////////////////////////////////////////////           
                                                                                            
 if((MOS_Err)||(A_DET_FL==0)/*(A_DET_IO==0)*/||ELE25_BIG_ERR_FL||ELE35_BIG_ERR_FL||ELE28_BIG_ERR_FL
	 ||ELE30_BIG_ERR_FL||ELE20_BIG_ERR_FL||ELE40_BIG_FL||NO_Connet_FL||NO_Connet_FL1
 ||ELE_InterruptDISP_TM||ELEAP_BIG_ERR_FL||ELEAP_BIG_ERR_FL1||ELEAP_BIG_ERR_FL2||ELEAP_BIG_ERR_FL3||ELEAP_BIG_ERR_FL4||ELEAP_BIG_ERR_FL5)
 {
	ELE_ERR_FL=1;   
	TurnHighSpeed_FL=0;
	TurnHighSpeed_FL_New=0;     
	 qudiao_shache_FL=1;   //各保护起效后，允许--停止刹车占空比输出
 }
	else
 if(G_S_FL==0)
 {
	 	ELE_ERR_FL=0;
	 TurnHighSpeed_FL=0;
	TurnHighSpeed_FL_New=0;
  qudiao_shache_FL=0;      //再次重踩脚踏后，允许标志位-清零
 }
 //-------------------------------------

	
//------------------------充电口--正常模式--测试模式入口----------------------
	
	   if(STOP_IO)
		 {
			 shangdian_yunxun_FL=0;
		  Stop_same=0;
      Stop_FL=0;			    //解除充电保护
		 }	
    
	
	if(STOP_IO==0)    //0为充电模式   1
			{
				Stop_same++;	
		
				if(Stop_same>4000)   //10ms=20     2s  插入充电插座后2s  功能才生效
				{
					Stop_FL=1;	     //进入充电保护
					yunxun_FL=0;
				}	
				 					
