chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
			}
	
//--------------------------------------------------------------------	
		
  if((DanWei_AD>=Vol_4_5V)||(CurDanWei_AD>=Vol_4_5V))              //档位板不连接
  {
    if(++NO_Connet_ct>6000)//6000*0.5MS=3S   
	  { 
	    NO_Connet_FL=1;
	  }
	  
     goto NoTestAD; 
   }
   else
   {

   	     NO_Connet_ct=0;
         NO_Connet_FL=0; 
   }

 if(DanWei_AD>CurDanWei_AD)/*判断AD变化大不大*/
  temp= DanWei_AD-CurDanWei_AD; 
  else
  temp= CurDanWei_AD-DanWei_AD; 
  
  if(temp>=10)
   goto NoTestAD;
  
//	 if(DanWei_AD>Vol_3_5V)          //  三档>3.5v
	
	if(DanWei==3)
  {
  
    ELE_BIG_SET1=ELE30A;
    ELE_BIG_SET2=ELE35A;  
	  ELE_BIG_SET3=ELE32A;

     ShaCheTM=10;//10*20MS
     
    FRONT_BACK_FL=1;
    DanWei_PWM=0xff;//97%
	  DanWei=3; /*高速档位*/
	  HIGH_LOWS_PEED_FL=1;/*为0低速*/
		
   }
  // else
	 // if(DanWei_AD>Vol_2_5V)         //二档  2.5V----3.5V
	 if(DanWei==2)
  {
       
     NO_Connet_FL=0;
    ELE_BIG_SET1=ELE17_5A;
    ELE_BIG_SET2=ELE25A;
	ELE_BIG_SET3=ELE21A;

    ShaCheTM=20;//20*20MS
    
    FRONT_BACK_FL=1;
    DanWei_PWM=153;//65%=166  60%=153
	DanWei=2;   /*中速档位*/
	HIGH_LOWS_PEED_FL=0;/*为0低速*/
   }
 //  else
	 // if(DanWei_AD>Vol_1V)        //一档    
	 if(DanWei==1)
   {
      
			NO_Connet_FL=0;
			ELE_BIG_SET1=ELE10A;
			ELE_BIG_SET2=ELE15A;
			//ELE_BIG_SET3=0XFF;  ELE12A
      ELE_BIG_SET3=ELE12A;
     ShaCheTM=20;//20*20MS
     
			FRONT_BACK_FL=1;
			DanWei_PWM=76;//35%=89    76=30%
			DanWei=1;  /*低速档位*/
			HIGH_LOWS_PEED_FL=0;/*为0低速*/
   }
	//else                    //倒挡
	 if(DanWei==0)
	{
	  	
	    NO_Connet_FL=0;
     ELE_BIG_SET1=ELE10A;
     ELE_BIG_SET2=ELE15A;
	 // ELE_BIG_SET3=0XFF;
		ELE_BIG_SET3=ELE12A;
     ShaCheTM=20;//20*20MS
     
	 FRONT_BACK_FL=0;
    DanWei_PWM=76;//40%=102  76=30%
	 DanWei=0;  /*倒档位*/
	 HIGH_LOWS_PEED_FL=0;/*为0低速*/
	}
	
    
  PWM_Ele_Set=DanWei_PWM;
  PWM_MAX_Set=PWM_Ele_Set;//128;


NoTestAD:

if((CHANGE_Off_TM==0)&&G_S_FL&&(ELE_ERR_FL==0))           //脚踏板踏下
   {
   
     if(FRONT_BACK_FL)
     {
       FRONT_FL=1;
       BACK_FL=0;
      }
     else
      {
       FRONT_FL=0;
       BACK_FL=1;
      }
   }
   else
   {	 
		 FRONT_FL=0;
		 BACK_FL=0;
   } 


	if(HIGH_LOWS_PEED_FLold!=HIGH_LOWS_PEED_FL)
	{
		HIGH_LOWS_PEED_FLold=HIGH_LOWS_PEED_FL;
		TurnHighSpeed_FL=0;
		TurnHighSpeed_FL_New=0;
		ELE_BIG_TM=0;
	}
	

///////////////////////////////////////
	   if((Stop_FL==1)||(VoltageLowFL==1))               //充电时或者低压时
	   {
				   BeginMoveBackTM=0;
		       BeginMoveFrontTM=0;
           turn_zero_fl=0;
           G_S_FL=0;
		   
		 }
	  else
			
      if(FRONT_FL)
        {
         if(FRONT_CTRL)
          DelayOffTM=ShaCheTM;//50MS/20MS=3	// 2*20MS后刹车
          BeginMoveBackTM=0;
		    if(BeginMoveFrontTM<250)
		       BeginMoveFrontTM++;
	  
				 if(BackOFFTime>24)// 24*20MS后再换向    24
					 { 
						BACK_CTRL=0;
						FrontOFFTime=0;  
						FRONT_CTRL=1;
						RELY=1;
					 }
					 else
					 BeginMoveFrontTM=0;  
		   }
        else
        {
					if(BACK_FL)
					 { 			
					 if(BACK_CTRL)
					 DelayOffTM=ShaCheTM; // 2*20MS后刹车
					 BeginMoveFrontTM=0;
					 if(BeginMoveBackTM<250)
						BeginMoveBackTM++;
							if(FrontOFFTime>24)  // 24*20MS后再换向24
							{
										FRONT_CTRL=0;
										BackOFFTime=0;
										BACK_CTRL=1;
										RELY=1;
							}
							else
						 {
								BeginMoveBackTM=0;
						 }

					 }
					 else
					 {
							 BeginMoveBackTM=0;
					     BeginMoveFrontTM=0;
					 }   
		  }
   if((BeginMoveBackTM>100)||(BeginMoveFrontTM>100))            //50ms/0.5MS=100
      {	
             if(PWM<25)          //最小启动占空比设置处
               PWM=25;//??
							
	         PWMADDTM++;                                //慢启动时间设置
		if(PWMADDTM>PWM_HUAN)//18=1.5S  //22==1.8s 11= 0.9s	   5=0.4s  3=0.2s  此处调整加速时间	 每0.1S =1.222值   12=1.2s    27=3s
		{
			  PWMADDTM=0;
	 			
			if(PWM_xianzhi_fl==0)
				{	
				 if((PWM>PWM_HallSet)/*&&(PWM>PWM_Ele_Set)*/&&(PWM>25))         //最小启动占空比设置处   12=1.2s
					PWM--;
						
					if((PWM<PWM_HallSet)/*&&(ELEbig25A_FL==0)*/)
						PWM++;
	   	 	}	   
					//---------------限流-----------------
					
					 if((Cur_ResultNew>57&&DanWei==3)||(Cur_ResultNew>57&&DanWei==2))    //限流调整  电流大于20A     20A=1.125V
						{
							 if(PWM>204&&DanWei==3)    //PWM>80%
							 {
								  xianliu_fl=1;											  
							 }
							 
							 if(PWM>140&&DanWei==2)    //PWM>55%
							 {
								  xianliu_fl=1;											  
							 }
							 
							if(xianliu_fl)		  //限流开始
             {								
							 PWM_xianzhi_fl=1;
							 PWM--;
							 PWM_HUAN=10;
							
							if(PWM<101&&DanWei==3)         
               PWM=101;               //40%
						  
							if(PWM<76&&DanWei==2)      //30%   
               PWM=76; 
							
							if((PWM<=102&&DanWei==3)||(PWM<=78&&DanWei==2))   //进入限流调整 25A 且PWM小于40%时 76=30%    102=40%
							{
							
								xianliu65_same++;
								 if(xianliu65_same>=500)     //5MS*500=2.5s
								 {
										ELE30_BIG_ERR_FL=1;
										ELE_Wait_5s=40;//WAIT 20S
									  xianliu65_same=0;
								 }
							}		
					         							
						/*	if((PWM>102&&DanWei==3)    //计数清零
							{
							  xianliu65_same=0;							
							}*/
						}				
				  }						
					//	else
					if(Cur_ResultNew<=57)
						{
							//  xianliu65_same=0;
						  //	xianliu_fl=0;      //   限流进入条件解除
						  //	jinxianliuTM=0;
							xianliu65_same=0;		
							PWM_xianzhi_fl=0;   //  
							PWM_HUAN=27;        //24=11ms    						
						} 
										
     }
					 	  		  	    	 
	   }
	   else	 
       {
	         PWM=0;
       }	
	
	      	
			TIME_20MS_CT++;
			 
		  if(TIME_20MS_CT>=41U)//20MS ???     电源指示灯
		  {
            TIME_20MS_CT=0;	
			
        if(POWER_on_TM<=POWER_ON_TM) //2000/20=100      
		  	POWER_on_TM++;
                           
				if(jia_close_led_fl==0)
				{
				 if(A_DET_FL==0||ELE40_BIG_FL||ELE35_BIG_ERR_FL||ELE25_BIG_ERR_FL
					 ||ELE_InterruptDISP_TM) //短路控制灯快闪时间
					{
						
						if(++LED_TM>5)     //20*5=100ms   
						 {							 
							 LED_TM=0;
							 LED_IO^=1;
						 }
					 }
					else
				if(++LED_TM>12)//0.25s=20ms*12.5
				 {
						 LED_TM=0;
						 LED_pwm++;

										if(LED_CT)
											{                 
												 if(LED_pwm<LED_CT)
													LED_IO^=1;
													else
													LED_IO=0;
											}
										
									 if(LED_pwm>=(LED_CT+4))
											{
												LED_pwm=0;
												LED_IO=1;
											
