chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
											}                
					}
			}
			
              if(MOS_Err==1)      //上桥短路闪6下
                {
                  LED_CT=12;

                }
              else if(MOS_Err==2)    //下桥短路闪7下
                {
                  LED_CT=14;

                }
              else
                
			      if(NO_Connet_FL||NO_Connet_FL1)
                {
                 LED_CT=8;
                }
             else
            if(VoltageLowFL)
                {
                 LED_CT=4;
                }
             else           
                 if(ELE30_BIG_ERR_FL||ELE20_BIG_ERR_FL||ELE28_BIG_ERR_FL)
                {
                 LED_CT=6;	 //3次
                }
                 else
                if(Stop_FL)    //充电时，进入灯闪1下
                {
									LED_CT=2;                         
                }
                 else
                {
                 LED_CT=0;							
                }
								
								
      //---------------20ms自加一次------------------------
								
				  if(DanWei_AD>Vol_3_5V)       //档位AD值判断  三档
						{	
							   DanWei=3;																								
						}
						 else
	             if(DanWei_AD>Vol_2_5V)       //二档
               {
							    DanWei=2;		
							 }								 
							 else
	              if(DanWei_AD>Vol_1V)       //一档
								{
								  DanWei=1;		
								}		
								else                    //倒档
								 {
								   DanWei=0;			 
								 }									 
															
				//------------------------------				
															
				/* if(ELE60_BIG_FL)               //60A过流保护生效标志     三档堵转
						 {
							 if(++ELE60_BIG_TM>=25)       //0.02*1=1
							 {
								 LED1_IO=0;
								duanlu_sw_fl=1;    //禁止电源开关关机
								duZ_close_fl=1;            //堵转后允许关机标志位
								ELE40_BIG_FL=1;  	 //灯快闪
							  ELE60_BIG_TM=0;
								ELE_Wait_5s=60;
							 }
						 }
							else
							{
								ELE60_BIG_TM=0;
								if(ELE_Wait_5s==0) 
								{
									ELE40_BIG_FL=0;
									if(duZ_close_fl)
										  POWER_IO=0;     //关机
								}									
							
							}*/
  
       if(++time_500ms>25)//0.5s 进入调整一次    20ms自加一次
			 {
				 time_500ms=0;     //500ms自加一次
					   				 			 
		    
	//-----在这里更改2min保护   5s保护  2s保护设置---------
     				
     //----------------------------2min保护-----------------------------------        
			   if(ELE30_BIG_FL)
				{
										
						//----------------------三级保护----------------------------------------	
													
							if(ceshi_zhengchang_FL==0)	  //正常模式
							{
						   	if(DanWei==0||DanWei==1)       //倒档和一档  2min保护  PWM_HallSet
									{
										if(++ELE30_BIG_TM>=240)//0.5s*240=120s   
										{
											ELE30_BIG_ERR_FL=1;  //
											ELE30_BIG_TM=0;
											ELE_Wait_5s=40;//WAIT 20S
										}
								 }
							}
							if(DanWei==2)            //二档 2min保护
							{
								if(++ELE30_BIG_TM>=240)//0.5s*240=120s   240
								{
									ELE30_BIG_ERR_FL=1;//
									ELE30_BIG_TM=0;
									ELE_Wait_5s=40;//WAIT 20S
								}					
							}
							
					     if(DanWei==3)    //   三档    1min
							{
								if(++ELE30_BIG_TM>=240)//0.5s*240=120s   
								{
									ELE30_BIG_ERR_FL=1;//
									ELE30_BIG_TM=0;
									ELE_Wait_5s=40;//WAIT 20S
								}					
							}
							
				}
				else
				{
					ELE30_BIG_TM=0;
				   if(ELE_Wait_5s==0)
            ELE30_BIG_ERR_FL=0;					
				}

    //---------------------------5s保护-------（二级保护）-----------------------------------
			 
			 if(ELE28_BIG_FL)
				{
				if(DanWei==0||DanWei==1) 
					{					
					 if(++ELE28_BIG_TM>=90)//0.5s*90=45S
						{
							ELE28_BIG_ERR_FL=1;//
							ELE28_BIG_TM=0;
								ELE_Wait_5s=40;
						}
					}
					
						if(DanWei==2)
						{
						  if(++ELE28_BIG_TM>=60)//0.5s*60=30S
								{
									ELE28_BIG_ERR_FL=1;//
									ELE28_BIG_TM=0;
										ELE_Wait_5s=40;
								}
						}
						
						if(DanWei==3)
						{
						  if(++ELE28_BIG_TM>=40)//0.5s*120=20S
								{
									ELE28_BIG_ERR_FL=1;//
									ELE28_BIG_TM=0;
										ELE_Wait_5s=40;
								}
						}				
				}
				else
				{
					  ELE28_BIG_TM=0;
				   if(ELE_Wait_5s==0)
             ELE28_BIG_ERR_FL=0;					
				}

    //----------------------------2s保护-----------------------------------
       if(ELE50_BIG_FL)
				{
					if(DanWei==0||DanWei==1)
          {						
						if(++ELE20_BIG_TM>=20)//0.5s*20=10S
						{
							ELE20_BIG_ERR_FL=1;//
							ELE20_BIG_TM=0;
							ELE_Wait_5s=40;
						}
				  }
						if(DanWei==2||DanWei==3)
						{
						  if(++ELE20_BIG_TM>=10)//0.5s*10=5S
							{
								ELE20_BIG_ERR_FL=1;//
								ELE20_BIG_TM=0;
									ELE_Wait_5s=40;
							}	
						}
												
				}
				else
				{
					ELE20_BIG_TM=0;        
				   if(ELE_Wait_5s==0)
             ELE20_BIG_ERR_FL=0;				 	
				}

    //---------------------------------------------
					 if(ELE12_BIG_FL)                                   //一档堵转生效后  
						 {                     
								if(++ELE12_BIG_TM>=5)// 5S/0.5*5=2.5s        // 堵转时间保护设置
							 {
								    duanlu_sw_fl=1;    //禁止电源开关关机
										 ELE25_BIG_ERR_FL=1;//
										 ELE12_BIG_TM=0;
										// ELE_Wait_5s=10;//WAIT 30S
								     duZ_close_fl=1;            //堵转后允许关机标志位
								 
										 if(duzhuan_30min_fl==0)
										 {
											 ELE_Wait_5s=60;        //30s    //0.5s自加一次
											 jia_zheng_close_fl=0;
										 }
										 else
										 {
											 ELE_Wait_5s=3600;            //30min=3600
											 jia_zheng_close_fl=1;
										 }
								 
								  duzhuan_cishu_fl=1;
								 }
						 }
						 else
						 {
								ELE12_BIG_TM=0;
								if(ELE_Wait_5s==0)
								{
								  if(jia_zheng_close_fl==0)    //假关机
										 {
											if(duZ_close_fl)
											{
												 //POWER_IO=0;     //关机											
												 LED_IO=0;      //假关机  
												 LED1_IO=1;
												jia_close_led_fl=1;
												if(duzhuan_cishu_fl)     //堵转计数
												{
														duzhuan_cishu_num++;
														if(duzhuan_cishu_num>=3)
														{
															 duzhuan_30min_fl=1;
														//	duzhuan_cishu_num=0;
														}
														
														duzhuan_cishu_fl=0;
												}
											}
										}
										else
										{
											POWER_IO=0;     //真关机										
										}
								}									
						 }
						 
						 
					 if(ELE13_BIG_FL)                       //二档堵转生效后
						 {                     
								if(++ELE13_BIG_TM>=2)// 5S/0.5*4=2s      // 堵转时间保护设置
							 {
								  duanlu_sw_fl=1;    //禁止电源开关关机
									 ELE35_BIG_ERR_FL=1;//
								  duZ_close_fl=1;            //堵转后允许关机标志位
									 ELE13_BIG_TM=0;
								 
								if(duzhuan_30min_fl==0)
								 {
								  ELE_Wait_5s=60;        //30s    //0.5s自加一次
									 jia_zheng_close_fl=0;
								 }
								 else
								 {
									 ELE_Wait_5s=3600; 
									 jia_zheng_close_fl=1;
								 }
								 
								 duzhuan_cishu_fl=1;
							 }
						 }
						 else
						 {
								  ELE13_BIG_TM=0;
								 if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
								 {
									 if(jia_zheng_close_fl==0)    //假关机
										 {
											if(duZ_close_fl)
											{
												 //POWER_IO=0;     //关机											
												 LED_IO=0;      //假关机  
												 LED1_IO=1;
												jia_close_led_fl=1;
												if(duzhuan_cishu_fl)     //堵转计数
												{
														duzhuan_cishu_num++;
														if(duzhuan_cishu_num>=3)
														{
															 duzhuan_30min_fl=1;
														//	duzhuan_cishu_num=0;
														}
														
														duzhuan_cishu_fl=0;
												}
											}
										}
										else
										{
											POWER_IO=0;     //真关机										
										}
								 }
									     			 
