chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
	//------------------------------------------------------	
 /* if(Cur_ResultNew > ELE60A&&DanWei==3)           //三档堵转保护     50A=2.81V=143
  {
	  	LED1_IO=~LED1_IO;			                     //700us左右
		ELE40_BIG_FL=1;       //保护  灯快闪
    ELE40_BIG_ct++;
  	ELE40_Small_ct=0;
 //  if(ELE40_BIG_ct>15)//20=200MS  5=50MS    15--130ms
  // {
		  //ELE40_BIG_FL=1;
	  	ELE_Wait_5s=60;        //保护解除要60=30s   0.5s自减一次     120=1min
	// }
		 duZ_close_fl=1;      //堵转允许关机标志位
		duanlu_sw_fl=1;    //禁止电源开关关机
  }
  else
	{	
			                                   
	  ELE40_BIG_ct=0;
		ELE40_Small_ct++;			
		if((ELE40_Small_ct>5)&&(ELE_Wait_5s==0))  
		{		
		   ELE40_BIG_FL=0;
			 if(duZ_close_fl)
				  POWER_IO=0;     //关机
		}			
			
	}*/

//----------------------------------------------------------
														
  if(Cur_ResultNew>ELE_BIG_SET2)
      {
            
				ELE50_BIG_ct++;
				ELE50_Small_ct=0;
				if(ELE50_BIG_ct>5)
				ELE50_BIG_FL=1;
      }
      else
        {            
          ELE50_BIG_ct=0;
            ELE50_Small_ct++;           
            if(ELE50_Small_ct>5)
                ELE50_BIG_FL=0;
        }
  
  if(Cur_ResultNew>ELE_BIG_SET1)
    {
          
      ELE30_BIG_ct++;
      ELE30_Small_ct=0;
    if(ELE30_BIG_ct>10)
          ELE30_BIG_FL=1;
    }
    else
      {       
        ELE30_BIG_ct=0;
          ELE30_Small_ct++;           
          if(ELE30_Small_ct>5)
              ELE30_BIG_FL=0;
      }


	  if(Cur_ResultNew>ELE_BIG_SET3)
      {
            
        ELE28_BIG_ct++;
        ELE28_Small_ct=0;
       if(ELE28_BIG_ct>5)
        ELE28_BIG_FL=1;
      }
      else
        {
            
          ELE28_BIG_ct=0;
            ELE28_Small_ct++;           
            if(ELE28_Small_ct>5)
                ELE28_BIG_FL=0;
        }
   
  }
 }
  else
	 if(AD_CH==7)
	 {
	    AD_CH=4;
      Enable_ADC_AIN1;    //速度开关    P30
      clr_ADCF;
      set_ADCS; 
      EADC=0;
	// HallPWM=ADtemp;
		 
		 	//---------油门大于4.8V  停止工作，显示故障灯闪4下
		
		if(ADtemp>HALL_4000MV) 
		{
		  NO_Connet_FL1=1;
		}
		 	 	 
	  if(ADtemp>HALL_1000MV)    //踩下脚踏  1.33v
	  {
		
		G_S_HighCT_fanjiao=0;
   //if(FRONT_CTRL==0&&BACK_CTRL==0)    //50ms生效后，判断继电器是否有吸合  没有才允许脚踏生效
	//	{
	    if(G_S_HighCT>=100) //10MS   0.5*20     100=50ms    200ms
		  {
		//	if(FRONT_CTRL==0&&BACK_CTRL==0)    //50ms生效后，判断继电器是否有吸合  没有才允许脚踏生效
		//		{
	        if(turn_zero_fl==1)/*&&(G_S_State==0))*/
            {
							if(G_S_State==0)	
               G_S_State=1;
								  						  
              if(G_S_State==2)
						   G_S_FL=1;         //脚踏板生效		
					  }	
				//}
		 //}
	    }
			ADtemp=ADtemp-HALL_1000MV;      //
			if(ADtemp>HALL_DV)
			ADtemp=HALL_DV;

			
			if((HIGH_LOWS_PEED_FL)&&(DanWei==3))    //高速档
			{
			   if(ADtemp<47)           //10%---40%  对应的电压
				 {
					 	PWM_HallSet=80;       //就是40%
					 DanWei3_40=1;
					 DanWei3_65=0;
				 }					 
				if(ADtemp>=47&&ADtemp<86)     //40%---65%  对应的电压
				{
			    PWM_HallSet=143;        //就是65%
					DanWei3_65=1;
					 DanWei3_40=0;
				}
					if(ADtemp>=86)        //大于65%    对应的电压
					{
			      PWM_HallSet=ADtemp*PWM_98_DV/HALL_DV;      //有霍尔变速
						 DanWei3_40=0;
						 DanWei3_65=0;
					}
			}
		
		 if((HIGH_LOWS_PEED_FL==0)&&(DanWei==2))    //二档  65%
		 {
		    if(ADtemp<95)       //10%--50%  统一40%
				{
				    PWM_HallSet=80;       //就是40%
					  DanWei2_40=1;
				}
				 if(ADtemp>=95)
				 {
				   PWM_HallSet=143;        //就是65% 
					  DanWei2_40=0;
				 }
		 
		 }
			 // PWM_HallSet=143;
			// PWM_HallSet=ADtemp*PWM_65_DV/HALL_DV; 

			if((HIGH_LOWS_PEED_FL==0)&&(DanWei==1))    //一档   40%
				PWM_HallSet=80;                             
			//PWM_HallSet=ADtemp*PWM_40_DV/HALL_DV; 

			if((HIGH_LOWS_PEED_FL==0)&&(DanWei==0))    //倒档   40%
			PWM_HallSet=ADtemp*PWM_40_DV/HALL_DV; 

			PWM_HallSet+=PWM_15;	
		 
	  }
	  else        //放开脚踏
	  {
	    if(ADtemp>HALL_0500MV)     //且大于0.5V  小于1.33V  
			{
          G_S_HighCT=0;	     
          NO_Connet_FL1=0;
			 if(G_S_HighCT_fanjiao>=100)    //50ms   连续50ms为低  才认为是松开脚踏
			 {
			    if((Stop_FL==0)&&(VoltageLowFL==0))
	         turn_zero_fl=1;
         
					 set_PWMRUN;       //PWM运行使能位开启
	        G_S_FL=0;
          G_S_State=0;
					PWM_xianzhi_fl=0;
					xianliu_fl=0;      //   限流进入条件解除
			
					DanWei3_40=0;
					DanWei3_65=0;
					DanWei2_40=0;
			 }						 
      }
			else       //小于0.5V  故障灯闪    
			{			
			    NO_Connet_FL1=1;			
			}
					
	  }
			
	 }
	 else
	  if(AD_CH==4)//速度和进退检测      
	 {
	    AD_CH=6;
      Enable_ADC_AIN7;     //电压检测   P11
      clr_ADCF;
      set_ADCS; 
      EADC=0;
           CurDanWei_AD=ADtemp;
            volHand_add+=ADtemp;            
           volHand_addct++;
           if(volHand_addct>=64)//>=255)  
           {           
           volHand_addct=0;
           DanWei_AD=volHand_add>>6;              //档位值
           volHand_add=0;  
            }
      
	  }
  	   else
	  if(AD_CH==6)//电压检测
	 {
	    AD_CH=5;
      Enable_ADC_AIN4;     //电流检测    P05        
      clr_ADCF;
      set_ADCS; 
      EADC=0;
      // Voltage_AD=ADtemp;

		   vol_add+=ADtemp;            
           vol_addct++;
           if(vol_addct==0)//>=64)//>=255)   //??32?,???? 64
           {
              
           vol_addct=0;
           Voltage_AD=vol_add>>8;//??
           vol_add=0;  
            }

	  }

}

void zidongguangji()
{
	if(FLAG_NMS)
	{
     FLAG_NMS=0;     //4ms自加一次
	if(jia_close_led_fl==0)
	{
		if(duanlu_sw_fl==0)      //当堵转保护后，禁止手动关电源
		{
			if(SW_FL)
				{
						if(SW_IO)
					 {
						 SW_yanshi++;
						 if(SW_yanshi>=5)   //按键防抖20ms
						 {						 
						   if(SW_IO)
							 {
						    	POWER_IO=0;     //关机
								 SW_yanshi=5;
							 }
					   }		      
					 }					                  						 
				}
	  }
	}
	
		if(jia_close_led_fl)      //当堵转保护计时灯灭后   按一下重新唤醒
		{
		   if(huanxing_fl==0)
				{
						if(SW_IO)
					 {
						 SW_yanshi++;
						 if(SW_yanshi>=5)   //按键防抖20ms
						 {						 
						   if(SW_IO)
							 {
								  huanxing_fl=1;							
						     LED_IO=1;      //开指示灯   亮
								 duZ_close_fl=0;
								 duanlu_sw_fl=0;
									ELE40_BIG_FL=0; 
									ELE35_BIG_ERR_FL=0; 
									ELE25_BIG_ERR_FL=0;   
								 SW_yanshi=0;
							 }
					   }		      
					 }		
          sw_songtimer=0;					 
				}
				
				if(huanxing_fl)
				{
				   if(SW_IO==0)
					 {  			 
								 sw_songtimer++;
						 
							if(sw_songtimer>=10)    //40ms   
								{
									 jia_close_led_fl=0;
									 sw_songtimer=0;
									huanxing_fl=0;
								}
					 }
				}
				
