chanvenjoe/STM32-learning/Projects/942-1709--限流20A(60)--二档加限流/SOURCE/MAIN.c
	  }
		
		
				
  	 if(SW_IO==0)
	   {  			 
			  SW_yanshi=0;      //清按键计数
		       sw_timer++;
			 
		    if(sw_timer>=10)    //40ms     //上电40ms后才允许去关机
					{
						sw_timer=0;
						SW_FL=1;	
					}
  				
	   //----------------------------------				
		   if(G_S_IO==0)
		   {
				if(STOP_IO)        //不充电时进入待机计时    
				{
					if(ELE_Wait_5s==0)     //
					{
			    guanji_timer++;
	            
				 if(guanji_timer>=250)
				  {
					 guanji_timer=0;				
						guangji_1stimer++;
					   if(guangji_1stimer>=60)      //1min
					   {
							 guangji_1stimer=0;
							  guangji_1mintimer++;
							    if(guangji_1mintimer>=10)     //
									{
									 POWER_IO=0;   
									}		                
					   }
					 }
				 }
			  }
		   }
		   else
		   {			 
             guanji_timer=0;
			       guangji_1stimer=0;
				    guangji_1mintimer=0;
		   }
		}
}
}


//-----------------???-----------------------------
void main(void)
{ 
  init();
 while(1)
  {  
		
		
		//--------看门狗设置------
      TA=0xAA;
      TA=0x55;
      WDCON = 0x7; 
     set_WDTR;
     set_WDCLR;
     set_EWDT;         //WDT看门狗使能位   
    
		PICON=0X80;			  //边沿触发和IO选择   P06
		PINEN=0X40;				 //使能--下降沿触发
		EIE=0X02;
					
		 zidongguangji();   //自动关机程序
		//---------------------------		
    time_dsp();  
    MoveCtrl();
    if(ADCF)
    ADC_DSP();
 
  }
}


void init_ISR()  interrupt 7 
{
    if(PIF==0X40)   //P06 管脚中断标志位   生效位 
		{		 
				Delay3us();
			if(A_DET_IO==0)
			{
		  ELE_InterruptDISP_TM = 20;    //20
			ELE_ERR_FL=1;   
			TurnHighSpeed_FL=0;
			TurnHighSpeed_FL_New=0;  			
			PWM5_P03_OUTPUT_DISABLE;
			PWM4_P01_OUTPUT_DISABLE;
			FLAG_IO_PWM=1;
			P03=1;//换为IO    //下桥
			P01=0;         //上桥
			turn_zero_fl=0;
		  clr_PWMRUN;                      //PWM运行使能位关闭
		// A_DET_FL=0;
			PWM=0;     
			
			//	MoveCtrl();	 
		  qudiao_shache_FL=1;   //各保护起效后，允许--停止刹车占空比输出
				
				PIF=0X00; 	       //清零
			}
			  PIF=0X00; 	       //清零
		}
}





